#include <iostream>
#include <cmath>

int main()
{
    long A = 60, B = 5, C = 7;
    long D = 180; // опис операндів у пам’яті
    float Y;

    __asm {
        finit      ; Очищення регістрів співпроцесора
        fldpi      ; Завантаження числа "пі" на вершину стека
        fdiv       ; Переведення з градусів в радіани
        fimul D    ; Множення на константу D(180)
        fidiv 180  ; Поділити на 180 (переведення в радіани)
        fptan      ; Обчислення часткового тангенса
        fdiv       ; Знаходження тангенса
        fmul ST, ST; Зведення у квадрат
        fidiv C    ; Обчислений "z" – аргумент для Arcsin
        fld ST      ; Копіювання вершини стека
        fmul ST, ST; Зведення у квадрат
        fld1        ; Включення "1" в стек
        fsubr     ; Вирахування з реверсом : 1 - z ^ 2
        fsqrt     ; Обчислення кореня 
        fpatan    ; Обчислення арктангенса
        fimul B   ;  Множення на константу B
        fstp Y    ; Збереження результату у змінну Y
    }

    std::cout << "Result: " << Y  << std::endl;

    return 0;
}
